from string import Template
system_prompt_ar =  Template( "\n".join([
    "أنت مساعد ذكي مخصص لتوليد إجابة على استفسار المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد الإجابة اعتمادًا فقط على المستندات المقدمة.",
    "تجاهل أي مستندات غير ذات صلة بسؤال المستخدم.",
    "إذا لم تتمكن من توليد إجابة مناسبة، يمكنك الاعتذار للمستخدم.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا.",
    "كن دقيقًا ومختصرًا وتجنب المعلومات غير الضرورية."
]))

document_prompt_ar = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى:",
        "$chunk_text"
    ])
)

footer_prompt_ar = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات أعلاه، يرجى توليد إجابة على سؤال المستخدم.",
        "## الإجابة:"
    ])
)